bharrisau/s08-245/include/mc9s08js8.h
/*** SPMSC2 - System Power Management Status and Control 2 Register; 0x0000180A ***/
typedef union {
  byte Byte;
  struct {
    byte PPDC        :1;                                       /* Partial Power Down Control */
    byte             :1; 
    byte PPDACK      :1;                                       /* Partial Power Down Acknowledge */
    byte PPDF        :1;                                       /* Partial Power Down Flag */
    byte LVWV        :1;                                       /* Low-Voltage Warning Voltage Select */
    byte LVDV        :1;                                       /* Low-Voltage Detect Voltage Select */
    byte             :1; 
    byte             :1; 
  } Bits;
} SPMSC2STR;
extern volatile SPMSC2STR _SPMSC2 @0x0000180A;
#define SPMSC2                          _SPMSC2.Byte
#define SPMSC2_PPDC                     _SPMSC2.Bits.PPDC
#define SPMSC2_PPDACK                   _SPMSC2.Bits.PPDACK
#define SPMSC2_PPDF                     _SPMSC2.Bits.PPDF
#define SPMSC2_LVWV                     _SPMSC2.Bits.LVWV
#define SPMSC2_LVDV                     _SPMSC2.Bits.LVDV

#define SPMSC2_PPDC_MASK                1U
#define SPMSC2_PPDACK_MASK              4U
#define SPMSC2_PPDF_MASK                8U
#define SPMSC2_LVWV_MASK                16U
#define SPMSC2_LVDV_MASK                32U


/*** FTRIM - Reserved for storage of FTRIM; 0x0000180C ***/
typedef union {
  byte Byte;
  struct {
    byte FTRIM_bit   :1;                                       /* Factory FTRIM value */ /*Warning: bit name is duplicated with register name*/
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} FTRIMSTR;
extern volatile FTRIMSTR _FTRIM @0x0000180C;
#define FTRIM                           _FTRIM.Byte
#define FTRIM_FTRIM                     _FTRIM.Bits.FTRIM_bit

#define FTRIM_FTRIM_MASK                1U


/*** MCGTRIM - Reserved for storage of MCGTRIM; 0x0000180D ***/
typedef union {
  byte Byte;
  struct {
    byte TRIM0       :1;                                       /* Factory trim value, bit 0 */
    byte TRIM1       :1;                                       /* Factory trim value, bit 1 */
    byte TRIM2       :1;                                       /* Factory trim value, bit 2 */
    byte TRIM3       :1;                                       /* Factory trim value, bit 3 */
    byte TRIM4       :1;                                       /* Factory trim value, bit 4 */
    byte TRIM5       :1;                                       /* Factory trim value, bit 5 */
    byte TRIM6       :1;                                       /* Factory trim value, bit 6 */
    byte TRIM7       :1;                                       /* Factory trim value, bit 7 */
  } Bits;
} MCGTRIMSTR;
extern volatile MCGTRIMSTR _MCGTRIM @0x0000180D;
#define MCGTRIM                         _MCGTRIM.Byte
#define MCGTRIM_TRIM0                   _MCGTRIM.Bits.TRIM0
#define MCGTRIM_TRIM1                   _MCGTRIM.Bits.TRIM1
#define MCGTRIM_TRIM2                   _MCGTRIM.Bits.TRIM2
#define MCGTRIM_TRIM3                   _MCGTRIM.Bits.TRIM3
#define MCGTRIM_TRIM4                   _MCGTRIM.Bits.TRIM4
#define MCGTRIM_TRIM5                   _MCGTRIM.Bits.TRIM5
#define MCGTRIM_TRIM6                   _MCGTRIM.Bits.TRIM6
#define MCGTRIM_TRIM7                   _MCGTRIM.Bits.TRIM7

#define MCGTRIM_TRIM0_MASK              1U
#define MCGTRIM_TRIM1_MASK              2U
#define MCGTRIM_TRIM2_MASK              4U
#define MCGTRIM_TRIM3_MASK              8U
#define MCGTRIM_TRIM4_MASK              16U
#define MCGTRIM_TRIM5_MASK              32U
#define MCGTRIM_TRIM6_MASK              64U
#define MCGTRIM_TRIM7_MASK              128U


/*** FPROTD - Flash Protection Defeat Register; 0x0000180E ***/
typedef union {
  byte Byte;
  struct {
    byte Bit0        :1;                                       /* FPROT_FPDIS can be set to 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} FPROTDSTR;
extern volatile FPROTDSTR _FPROTD @0x0000180E;
#define FPROTD                          _FPROTD.Byte
#define FPROTD_Bit0                     _FPROTD.Bits.Bit0

#define FPROTD_Bit0_MASK                1U


/*** SIGNATURE - SIGNATURE Register; 0x0000180F ***/
typedef union {
  byte Byte;
} SIGNATURESTR;
extern volatile SIGNATURESTR _SIGNATURE @0x0000180F;
#define SIGNATURE                       _SIGNATURE.Byte


/*** DBGCA - Debug Comparator A Register; 0x00001810 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DBGCAH - Debug Comparator A High Register; 0x00001810 ***/
    union {
      byte Byte;
      struct {
        byte Bit8        :1;                                       /* Comparator A High Compare Bit 8 */
        byte Bit9        :1;                                       /* Comparator A High Compare Bit 9 */
        byte Bit10       :1;                                       /* Comparator A High Compare Bit 10 */
        byte Bit11       :1;                                       /* Comparator A High Compare Bit 11 */
        byte Bit12       :1;                                       /* Comparator A High Compare Bit 12 */
        byte Bit13       :1;                                       /* Comparator A High Compare Bit 13 */
        byte Bit14       :1;                                       /* Comparator A High Compare Bit 14 */
        byte Bit15       :1;                                       /* Comparator A High Compare Bit 15 */
      } Bits;
    } DBGCAHSTR;
    #define DBGCAH                      _DBGCA.Overlap_STR.DBGCAHSTR.Byte
    #define DBGCAH_Bit8                 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit8
    #define DBGCAH_Bit9                 _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit9
    #define DBGCAH_Bit10                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit10
    #define DBGCAH_Bit11                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit11
    #define DBGCAH_Bit12                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit12
    #define DBGCAH_Bit13                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit13
    #define DBGCAH_Bit14                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit14
    #define DBGCAH_Bit15                _DBGCA.Overlap_STR.DBGCAHSTR.Bits.Bit15
    
